app/controllers/work_places_controller.rb

SELECT  "work_places".* FROM "work_places" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "work_places"
---
  def index
    #作成された順に降順で表示
    if user_signed_in?
      # flash[:alert] = 'ログインしました'
      @work_places = WorkPlace.page(params[:page]).per(PER)

SELECT  "work_places".* FROM "work_places" WHERE "work_places"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    if user_signed_in?

      @work_place = WorkPlace.find(params[:id])

INSERT INTO "work_places" ("name", "region", "tel", "url", "user_id", "created_at", "updated_at", "address", "opentime", "closetime") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @work_place = WorkPlace.new(work_place_params)

    respond_to do |format|
      if @work_place.save

SELECT  "work_places".* FROM "work_places" WHERE "work_places"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "work_places" WHERE "work_places"."id" = ?  [["id", 3]]
---
  def destroy
    @work_place = WorkPlace.find(params[:id])
    @work_place.destroy